[
    {
        "id": "20",
        "title":"About me",
        "subtitle":"Made with HTML and CSS",
        "brief":"About me page made with Semanthic HTML and responsive CSS using SASS. Designed first in Figma. One page style with horizontal scroll through animation.",
        "image": "",
        "methology": "One page with sections as slides. Navigation between sections through a top menu which activates an animation translating the scenario in the X axis.",
        "tools": ["HTML", "SASS"],
        "link": "https://saxxan.github.io/aboutMe/",
        "git": "https://github.com/Saxxan/aboutMe"
    },
    {
        "id": "21",
        "title":"GoDog",
        "subtitle":"Made with HTML, SASS and JavaScript",
        "brief":"In this project, I created a contact website between dog owners and dog keepers using HTML, SASS and JavaScript. The objective of this page is to make contact between them easier, having more options to search or offer a service.",
        "image1": "/godog-svg.svg",
        "imageBig": "/godog-search-mockup.png",
        "text2": "The project is formed by different pages in HTML. The style is structured in a SASS directory. The main core in this project is the search filter made with JavaScript. The code take the input values of the search filter form and compares them with the users data. The users with the same values will appear under the form.",
        "tools": ["HTML", "SASS", "JavaScript"],
        "link": "https://saxxan.github.io/GoDog/",
        "git": "https://github.com/Saxxan/GoDog"
    },
    {
        "id": "22",
        "title":"Portfolio",
        "subtitle":"Made with HTML, CSS and React",
        "brief":"This project represents the professional portfolio as a UX/UI Designer and a Front-end Developer. The project also shows my skills after a year of learning.",
        "image1": "/portfolio-landing-mockup.png",
        "image2": "/portfolio-swiper-mockup.png",
        "image3": "/portfolio-project-mockup.png",
        "image4": "/portfolio-contact-mockup.png",
        "methology": "The portfolio is created with React and styled components library mainly. It is formed by a Header and a main container which content will change depending on the page.",
        "text1": "Navigation is set with react-router-dom, using the location pathname to create routes for each page of the project. Styled functional components designed for reuse.",
        "tools": ["HTML", "CSS", "React", "Styled Components", "SwiperJS"],
        "link": "https://saxxan.github.io/portfolio/",
        "git": "https://github.com/Saxxan/portfolio"
    }
]